# Column Combiner

In [1]:
# 임포트 판다스

import pandas as pd
from pandas import DataFrame, Series

## (설명1) 컬럼 2개의 내용을 합쳐서, 새로운 컬럼 만들기

In [18]:
df = DataFrame( {'name':['apple','banana','grape'], 
                 'color':['red','yellow','purple'],
                 'price':[100,200,300],
                 'kg':[0.1,0.2,0.1]})
df

     name   color  price   kg
0   apple     red    100  0.1
1  banana  yellow    200  0.2
2   grape  purple    300  0.1

- 뭔가 메소드(함수)를 사용해야 할 것 같은데 ??
- 이게 가능하면 오늘 수업 끝

In [19]:
type(1.)

float

### 문자열 + 문자열(string)

In [20]:
df['name_color']=df['name'] + df['color']
df

     name   color  price   kg    name_color
0   apple     red    100  0.1      applered
1  banana  yellow    200  0.2  bananayellow
2   grape  purple    300  0.1   grapepurple

### 문자열 + 정수(int)

In [21]:
df['name_price']=df['name'] + '_' + df['price'].astype(str)
df

     name   color  price   kg    name_color  name_price
0   apple     red    100  0.1      applered   apple_100
1  banana  yellow    200  0.2  bananayellow  banana_200
2   grape  purple    300  0.1   grapepurple   grape_300

### 문자열 + 실수(float)

In [22]:
df['name_kg']=df['name'] + '_' + df['kg'].astype(str)
df

     name   color  price   kg    name_color  name_price     name_kg
0   apple     red    100  0.1      applered   apple_100   apple_0.1
1  banana  yellow    200  0.2  bananayellow  banana_200  banana_0.2
2   grape  purple    300  0.1   grapepurple   grape_300   grape_0.1

## (설명2) 컬럼 2개의 내용을 합쳐서, 새로운 컬럼 만들기

- 뭔가 매칭 시켜주는 기준이 있어야 겠죠 !!! (인덱스 여기서는 0,1,2)

In [23]:
df1 = DataFrame( {'name':['apple','banana','grape'], 
                 'color':['red','yellow','purple'],
                 'price':[100,200,300],
                 'kg':[0.1,0.2,0.1]})
df2 = DataFrame( {'name':['apple','banana','grape'], 
                 'color':['red','yellow','purple'],
                 'price':[100,200,300],
                 'kg':[0.1,0.2,0.1]})

In [24]:
df1

     name   color  price   kg
0   apple     red    100  0.1
1  banana  yellow    200  0.2
2   grape  purple    300  0.1

In [25]:
df2

     name   color  price   kg
0   apple     red    100  0.1
1  banana  yellow    200  0.2
2   grape  purple    300  0.1

In [27]:
df2['name2'] = df1['name'] + '_' + df2['color']
df2

     name   color  price   kg          name2
0   apple     red    100  0.1      apple_red
1  banana  yellow    200  0.2  banana_yellow
2   grape  purple    300  0.1   grape_purple